Revit 2027 API
FailureMessage.SetAdditionalElements Method
 Sets the additional reference elements for the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureMessage SetAdditionalElements(
	ICollection<ElementId> additionalElements
)
Public Function SetAdditionalElements (
	additionalElements As ICollection(Of ElementId)
) As FailureMessage
public:
FailureMessage^ SetAdditionalElements(
	ICollection<ElementId^>^ additionalElements
)
member SetAdditionalElements :
        additionalElements : ICollection<ElementId> -> FailureMessage
Parameters
additionalElements ICollection<ElementId>
 The additional elements.
Return Value
FailureMessage
 The FailureMessage.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This FailureMessage is already posted to a document
Remarks
 Additional elements are used to highlight additional information to the user. They are not considered as causing the failure, but are related to it. User cannot delete them in extended error dialog.
See Also
Reference
FailureMessage Class
Autodesk.Revit.DB Namespace